In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('./gen_hospital.db')

In [1]:
import pandas as pd
doctors_patients_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/4-has-many-through-reading/doctors_patients.csv"
doctors_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/4-has-many-through-reading/doctors.csv"
patients_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/4-has-many-through-reading/patients.csv"
doctors_df = pd.read_csv(doctors_url)
patients_df = pd.read_csv(patients_url)
doctors_patients_df = pd.read_csv(doctors_patients_url)

In [4]:
doctors_df.to_sql('doctors', conn, index = False)
patients_df.to_sql('patients', conn, index = False)
doctors_patients_df.to_sql('doctors_patients', conn, index = False)

In [5]:
cursor = conn.cursor()
cursor.execute('SELECT name from sqlite_master where type= "table"')
cursor.fetchall()

[('doctors',), ('patients',), ('doctors_patients',)]

In [8]:
pd.read_sql('select * from doctors;', conn)

   id first_name last_name              position
0   1    Gregory     House  General Practitioner
1   2       Lisa     Cuddy          Chief Doctor
2   3      James    Wilson     Cancer Specialist
3   4     Robert     Chase              Resident
4   5       Eric   Foreman     Practicing Doctor

In [9]:
pd.read_sql('select * from patients;', conn)

   id first_name last_name   birthday
0   1      Jerry  Seinfeld   1962-3-3
1   2     Elaine     Benis   1966-4-5
2   3      Cosmo    Kramer  1960-5-10
3   4   Costanza    George  1962-6-10

In [10]:
pd.read_sql('select * from doctors_patients;', conn)

   id  doctor_id  patient_id
0   1          2           3
1   2          1           4
2   3          5           2
3   4          2           4
4   5          4           3
5   6          5           1

In [16]:
pd.read_sql('''select patients.first_name, patients.last_name from doctors_patients 
JOIN patients ON patients.id = doctors_patients.patient_id
JOIN doctors ON doctors.id = doctors_patients.doctor_id 
where doctors.last_name = "Cuddy" ''', conn)

  first_name last_name
0      Cosmo    Kramer
1   Costanza    George

In [ ]:
'''SELECT patients.name from doctors_patients 
JOIN patients ON patients.id = doctors_patients.patient_id 
JOIN doctors ON doctors.id = doctors_patients.doctor_id
where doctors.first_name = Gregory'''